Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 3, 256, 256,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 1, 256, 256,  32          input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1, 256, 256,  0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 256, 256,  0           conv3d_1[0][0]                   
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 1, 256, 256,  1600        concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 256, 256,  0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 1, 256, 256,  2320        activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1, 256, 256,  0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 1, 128, 128,  0           activation_2[0][0]               
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 1, 128, 128,  4640        max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 1, 128, 128,  0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 1, 128, 128,  9248        activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 1, 128, 128,  0           conv3d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)  (None, 1, 64, 64, 32 0           activation_4[0][0]               
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 1, 64, 64, 48 13872       max_pooling3d_2[0][0]            
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 1, 64, 64, 48 0           conv3d_6[0][0]                   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 1, 64, 64, 48 20784       activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 1, 64, 64, 48 0           conv3d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_3 (MaxPooling3D)  (None, 1, 32, 32, 48 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 1, 32, 32, 64 27712       max_pooling3d_3[0][0]            
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 1, 32, 32, 64 0           conv3d_8[0][0]                   
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 1, 32, 32, 64 36928       activation_7[0][0]               
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 1, 32, 32, 64 0           conv3d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 1, 64, 64, 64 0           activation_8[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 64, 64, 11 0           up_sampling3d_1[0][0]            
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 1, 64, 64, 48 48432       concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 1, 64, 64, 48 0           conv3d_10[0][0]                  
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 1, 64, 64, 48 20784       activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 1, 64, 64, 48 0           conv3d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 1, 128, 128,  0           activation_10[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 128, 128,  0           up_sampling3d_2[0][0]            
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 1, 128, 128,  23072       concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 1, 128, 128,  0           conv3d_12[0][0]                  
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 1, 128, 128,  9248        activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 1, 128, 128,  0           conv3d_13[0][0]                  
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 1, 256, 256,  0           activation_12[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 1, 256, 256,  0           up_sampling3d_3[0][0]            
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 1, 256, 256,  6928        concatenate_4[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 256, 256,  0           conv3d_14[0][0]                  
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 1, 256, 256,  2320        activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1, 256, 256,  0           conv3d_15[0][0]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 1, 256, 256,  0           activation_14[0][0]              
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 1, 256, 256,  40          concatenate_5[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 256, 256,  0           conv3d_16[0][0]                  
==================================================================================================
Total params: 227,960
Trainable params: 227,960
Non-trainable params: 0
__________________________________________________________________________________________________
